{
  // Generic errors
  "You do not have permission to use this command.": "No tienes permiso para usar este comando.",
  "🚫 You cannot access this channel because you have been blocked by its owner.": "🚫 No puedes acceder a este canal porque el propietario te bloqueó.",
  "Menu closed.": "Menú cerrado.",
  "Only the owner of the channel can rename it.": "Solo el dueño del canal puede cambiarle el nombre.",
  // Transfer ownership
  "Select the new owner of the channel:": "Selecciona el nuevo dueño del canal:",
  // Ban
  "Select the user you want to block:": "Selecciona al usuario que quieres bloquear:",
  // Deafen
  "Select the user you want to deafen:": "Selecciona al usuario que quieres ensordecer:",
  // Kick
  "Select the user you want to kick:": "Selecciona al usuario que quieres expulsar:",
  // Search user
  "Select the user you want to locate:": "Selecciona al usuario que quieres ubicar:",
  // Mute
  "Select the user you want to mute:": "Selecciona al usuario que quieres silenciar:",
  // Undeafen
  "Select the user you want to undeafen:": "Selecciona al usuario que quieres quitarle el ensordecimiento:",
  // Unmute
  "Select the user you want to unmute:": "Selecciona al usuario que quieres desilenciar:",
  // Claim channel
  "You must be connected to a voice channel to claim it.": "Debes estar conectado a un canal de voz para reclamarlo.",
  "You must be in a voice channel to use this command.": "Debes estar en un canal de voz para usar este comando.",
  "An error occurred while renaming the channel": "Ocurrió un error al renombrar el canal",
  "An error occurred while transferring channel ownership": "Ocurrió un error al transferir la propiedad del canal",
  "Invalid user or channel not available": "Usuario inválido o canal no disponible",
  "Invalid user or no active voice channel": "Usuario inválido o ningún canal de voz activo",
  "Invalid user or unavailable channel": "Usuario inválido o canal no disponible",
  "Only the channel owner can deafen users": "Solo el dueño del canal puede ensordecer usuarios",
  "Only the channel owner can undeafen users": "Solo el dueño del canal puede quitar el ensordecimiento",
  "Only the channel owner can unmute users": "Solo el dueño del canal puede desilenciar usuarios",
  "Only the owner can transfer the channel": "Solo el dueño puede transferir el canal",
  "Only the owner of the channel can block users": "Solo el dueño del canal puede bloquear usuarios",
  "Only the owner of the channel can change the name": "Solo el dueño del canal puede cambiar el nombre",
  "Only the owner of the channel can kick users": "Solo el dueño del canal puede expulsar usuarios",
  "Only the owner of the channel can mute users": "Solo el dueño del canal puede silenciar usuarios",
  "Only the owner of the channel can rename it": "Solo el dueño del canal puede renombrarlo",
  "The user is not in your voice channel": "El usuario no está en tu canal de voz",
  "There are no deafened users in your channel": "No hay usuarios ensordecidos en tu canal",
  "There are no muted users in your channel": "No hay usuarios silenciados en tu canal",
  "This channel has already been claimed by another user": "Este canal ya fue reclamado por otro usuario",
  "You already own this channel": "Ya eres dueño de este canal",
  "You cannot block an administrator or a user with admin roles": "No puedes bloquear a un administrador o a un usuario con roles de administrador",
  "You cannot kick an administrator or a user with administrative roles": "No puedes expulsar a un administrador o a un usuario con roles administrativos",
  "You do not have permission to perform this action": "No tienes permiso para realizar esta acción",
  "You do not have permission to transfer this channel": "No tienes permiso para transferir este canal",
  "You do not have permission to use this command": "No tienes permiso para usar este comando",
  "You must be in a voice channel to mute someone": "Debes estar en un canal de voz para silenciar a alguien",
  "You must be in a voice channel to rename it": "Debes estar en un canal de voz para renombrarlo",
  "You must be in a voice channel to transfer it": "Debes estar en un canal de voz para transferirlo",
  "You must be in a voice channel to undeafen someone": "Debes estar en un canal de voz para quitar el ensordecimiento a alguien",
  "You must be in a voice channel to unmute someone": "Debes estar en un canal de voz para desilenciar a alguien",
  "You must be in a voice channel to use this option": "Debes estar en un canal de voz para usar esta opción",
  "🔇 The user is not connected to any voice channel": "🔇 El usuario no está conectado a ningún canal de voz",
  "An error occurred while executing this action": "Ocurrió un error al ejecutar esta acción",
  "An error occurred while updating permissions": "Ocurrió un error al actualizar los permisos",
  "Only administrators can use this command": "Solo los administradores pueden usar este comando",
  "Only the channel owner can transfer ownership": "Solo el dueño del canal puede transferir la propiedad",
  "Only the channel owner can use this command": "Solo el dueño del canal puede usar este comando",
  "Only the owner of the channel can change its privacy settings": "Solo el dueño del canal puede cambiar su privacidad",
  "Only the owner of the channel can change its visibility": "Solo el dueño del canal puede cambiar su visibilidad",
  "Only the owner of the channel can deafen users": "Solo el dueño del canal puede ensordecer usuarios",
  "Only the owner of the channel can undeafen a user": "Solo el dueño del canal puede quitar el ensordecimiento a un usuario",
  "Only the owner of the channel can unmute users": "Solo el dueño del canal puede desilenciar usuarios",
  "Only the owner of the channel can use this command": "Solo el dueño del canal puede usar este comando",
  "There are currently no active temporary channels": "Actualmente no hay canales temporales activos",
  "This action is not implemented yet": "Esta acción aún no está implementada",
  "You can only add users to a private channel that you own": "Solo puedes añadir usuarios a un canal privado que posees",
  "You can only remove users from a private channel that you own": "Solo puedes eliminar usuarios de un canal privado que posees",
  "You cannot block a user with an administrative role": "No puedes bloquear a un usuario con un rol administrativo",
  "You cannot block an administrator": "No puedes bloquear a un administrador",
  "You cannot kick a user with an administrative role": "No puedes expulsar a un usuario con un rol administrativo",
  "You cannot kick an administrator": "No puedes expulsar a un administrador",
  "You must be connected to a voice channel to claim it": "Debes estar conectado a un canal de voz para reclamarlo",
  "You must be connected to a voice channel": "Debes estar conectado a un canal de voz",
  "You must be in a private channel to use this command": "Debes estar en un canal privado para usar este comando",
  "You must be in a private voice channel to use this command": "Debes estar en un canal de voz privado para usar este comando",
  "You must be in a temporary channel to use this command": "Debes estar en un canal temporal para usar este comando",
  "You must be in a temporary voice channel to use this command": "Debes estar en un canal de voz temporal para usar este comando",
  "You must be in a voice channel to transfer ownership": "Debes estar en un canal de voz para transferir la propiedad",
  "You must be in a voice channel to use this command": "Debes estar en un canal de voz para usar este comando",
  "You must be in a voice channel to use this feature": "Debes estar en un canal de voz para usar esta función",
  "❌ Failed to rename the channel on Discord": "❌ No se pudo renombrar el canal en Discord",
  "❌ This channel is not registered as a base channel": "❌ Este canal no está registrado como canal base",
  "✅ The base channel has been renamed to **{name}**.": "✅ El canal base ha sido renombrado a **{name}**.",
  "Base channel **{name}** created. User limit stored in the database: {limit}.": "El canal base **{name}** ha sido creado. Límite de usuarios guardado en la base de datos: {limit}.",
  "The role **{role}** now has administrative privileges.": "El rol **{role}** ahora tiene privilegios administrativos.",
  "The role **{role}** no longer has administrative privileges.": "El rol **{role}** ya no tiene privilegios administrativos.",
  "✅ Channel **{name}** has been registered as a base channel with a user limit of {limit}.": "✅ El canal **{name}** ha sido registrado como base con un límite de {limit}.",
  "The base channel **{name}** has been deleted.": "El canal base **{name}** ha sido eliminado.",
  "Channel renamed to **{name}**.": "Canal renombrado a **{name}**.",
  "The channel is now {state}.": "El canal ahora es {state}.",
  // Ban result
  "User **{user}** has been blocked from the channel.": "El usuario **{user}** ha sido bloqueado del canal.",
  // Claim success
  "You are now the owner of the channel **{name}**.": "Ahora eres el dueño del canal **{name}**.",
  // Unmute result
  "User **{user}** has been unmuted.": "El usuario **{user}** ha sido desilenciado.",
  // Mute result
  "User **{user}** has been muted.": "El usuario **{user}** ha sido silenciado.",
  // Speak again
  "User **{user}** can now speak again.": "El usuario **{user}** puede hablar de nuevo.",
  // Kick result
  "User **{user}** has been kicked from the channel.": "El usuario **{user}** ha sido expulsado del canal.",
  // Deafen result
  "User **{user}** has been deafened.": "El usuario **{user}** ha sido ensordecido.",
  // Transfer result
  "You have transferred ownership of the channel to **{user}**.": "Has transferido la propiedad del canal a **{user}**.",
  // Channel created
  "The channel **{name}** has been created.": "El canal **{name}** ha sido creado.",
  // Undeafen result
  "User **{user}** can now hear again.": "El usuario **{user}** puede oír de nuevo.",
  // Privacy toggle
  "The channel **{name}** is now private.": "El canal **{name}** ahora es privado.",
  // Privacy toggle
  "The channel **{name}** is now public.": "El canal **{name}** ahora es público.",
  // Unban result
  "User **{user}** can now join your channel.": "El usuario **{user}** ahora puede unirse a tu canal.",
  // Ban confirmation
  "User **{user}** has been blocked from this channel.": "El usuario **{user}** ha sido bloqueado de este canal.",
  // Remove user
  "User **{user}** no longer has access to your channel.": "El usuario **{user}** ya no tiene acceso a tu canal."
  // Menu labels
  ,"Temporary Voice Channel Management System": "Sistema de Gestión de Canales de Voz Temporales",
  "🎛️ Temporary Channel Control Panel": "🎛️ Panel de Control de Canales Temporales",
  "Rename": "Renombrar",
  "Privacy": "Privacidad",
  "Claim": "Reclamar",
  "Next page": "Siguiente página",
  "Ban": "Bloquear",
  "Kick": "Expulsar",
  "Unban": "Desbloquear",
  "Close menu": "Cerrar menú",
  "🎛️ Advanced Channel Options": "🎛️ Opciones Avanzadas del Canal",
  "Mute": "Silenciar",
  "Unmute": "Desilenciar",
  "Deafen": "Ensordecer",
  "Undeafen": "Quitar ensordecimiento",
  "Back": "Atrás",
  "Search user": "Buscar usuario",
  // Help command
  "📖 Help - Temporary Voice Channels": "📖 Ayuda - Canales de Voz Temporales",
  "Here is a list of useful commands to manage your temporary voice channel:": "Aquí hay una lista de comandos útiles para manejar tu canal de voz temporal:",
  "Grants a user access to your private voice channel.": "Concede a un usuario acceso a tu canal de voz privado.",
  "Displays this help menu.": "Muestra este menú de ayuda.",
  "Blocks a user from joining your voice channel.": "Bloquea a un usuario para que no se una a tu canal de voz.",
  "Shows what channel a user is in and allows you to join.": "Muestra en qué canal está un usuario y te permite unirte.",
  "Defines a base channel to generate temporary channels.": "Define un canal base para generar canales temporales.",
  "Creates a custom voice channel (public or private).": "Crea un canal de voz personalizado (público o privado).",
  "Undeafens a user in your channel.": "Quita el ensordecimiento a un usuario en tu canal.",
  "Unmutes a user in your channel.": "Quita el silencio a un usuario en tu canal.",
  "Prevents a user from hearing others in your channel.": "Impide que un usuario escuche a otros en tu canal.",
  "Kicks a user from your claimed channel.": "Expulsa a un usuario de tu canal reclamado.",
  "Mutes a user in your channel.": "Silencia a un usuario en tu canal.",
  "Makes your channel private.": "Convierte tu canal en privado.",
  "Makes your channel public.": "Convierte tu canal en público.",
  "Revokes a user's access to your private channel.": "Revoca el acceso de un usuario a tu canal privado.",
  "Claims ownership of the channel you are in.": "Reclama la propiedad del canal en el que estás.",
  "Changes the name of your channel (owner only).": "Cambia el nombre de tu canal (solo el dueño).",
  "Sets admin roles that cannot be kicked or banned.": "Establece roles de admin que no pueden ser expulsados ni bloqueados.",
  "Transfers channel ownership to another user.": "Transfiere la propiedad del canal a otro usuario.",
  "Temporary Voice Channel Bot": "Bot de Canales de Voz Temporales"
}
